package com.monkeyzi.oauth.enums;

import lombok.Getter;

/**
 * @author: 高yg
 * @date: 2018/10/11 22:17
 * @qq:854152531@qq.com
 * @blog http://www.monkeyzi.xin
 * @description:
 */
@Getter
public enum  ErrorCodeEnum {
    /**
     * 全局
     */
    GL500(500,"系统异常"),
    GL400(400,"Bad request"),
    GL404(404,"资源不存在"),
    GL405(405,"请求方法不支持"),
    GL415(415,"不支持媒体类型"),
    GL401(401,"请登录认证"),
    GL403(403,"抱歉，您没有权限！"),
    GL10001(10001, "参数异常"),
    GL10002(10002, "手速太快了吧！慢点点！"),
    GL10003(10003, "当前在线人数太多,请稍后重试！"),
    GL10004(10004, "redis限流出错"),
    GL10005(10005, "您没有设置文件上传配置"),
    /**
     * 用户部分
     */
    US001(001,"用户名不能为空"),
    US002(002,"登录名已存在userName=%s"),
    US003(003,"用户不存在"),
    US004(004,"用户ID不能为空"),
    US005(005,"越权操作,不能操作自己账户"),
    US006(006,"越权操作,不能操作管理员"),
    /**
     * 菜单/权限部分
     */
    PS101(101,"权限名已存在"),
    PS102(102,"权限路径已存在"),
    PS103(103,"权限不存在"),
    /**
     * 组织/部门部分
     */
    DS201(2001,"部门不存在"),
    DS202(2002,"部门编码已存在"),
    DS203(2003,"部门Id不能为空"),
    DS204(2004,"不能设置自己为上级部门"),
    DS205(2005,"该部门下有用户,不能直接删除"),
    /**
     * 角色部分
     */
    RS301(301,"绑定的角色不存在roleId=%s"),
    RS302(302,"角色名已存在 roleName=%s"),
    RS303(303,"角色编码已存在 roleCode=%s"),
    RS304(304,"越权操作,不能操作管理员角色"),
    RS305(305,"系统已经存在默认角色"),
    RS306(306,"角色Id不能为空"),
    RS307(307,"角色不存在 roleId=%s"),

    /**
     * 定时任务
     */
    JS401(4101,"任务类名已存在"),
    JS402(4102,"定时任务添加失败"),
    JS403(4103,"任务类名找不到任务类"),
    JS404(4104,"删除定时任务失败"),
    JS405(4105,"定时任务Id不能为空"),
    JS406(4106,"定时任务不存在"),
    JS407(4107,"暂停定时任务失败"),
    JS408(4108,"恢复执行定时任务失败"),
    /**
     * 文件部分
     */
    FU501(5101,"文件上传失败"),
    FU502(5102,"文件夹Id不能为空"),
    FU503(5103,"文件夹不存在"),
    FU504(5104,"父级文件夹不存在"),
    FU505(5105,"删除文件失败"),
    FU506(5106,"文件格式不能修改");

    /**
     * 消息部分
     */

    private int code;
    private String msg;
    ErrorCodeEnum(int code,String msg){
        this.code=code;
        this.msg=msg;
    }

    /**
     * 根据code获取枚举
     * @param code
     * @return
     */
   public static ErrorCodeEnum getEnum(int code){
        for (ErrorCodeEnum em:ErrorCodeEnum.values()){
            if (em.code==code){
                return em;
            }
        }
        return null;
   }

}
